# Basics Of Data Frame

In [2]:
#Exp no.:3

In [ ]:
#Aim : To study basics of data frame

In [1]:
#Name:Yashraj Dipak Gawande
#Roll no.:18
#Section:3B
#Subject:DSS
#Date:07/08/2025

# Creating Series

In [1]:
import pandas as pd

In [2]:
Name=["Ashish","Sagar","Shrikant","Lovely","Saurabh"]

In [3]:
Name

['Ashish', 'Sagar', 'Shrikant', 'Lovely', 'Saurabh']

In [4]:
Roll_list=pd.Series(Name,index=[1,2,3,4,5])

In [5]:
print(Roll_list)

1      Ashish
2       Sagar
3    Shrikant
4      Lovely
5     Saurabh
dtype: object

# Creating Data Frame

In [6]:
import pandas as pd

In [7]:
df=pd.DataFrame([[10,12,45,60],[54,70,26,90],[78,89,45,24]],columns=["CD","DBMS","DSS","CAO"])

In [8]:
df

   CD  DBMS  DSS  CAO
0  10    12   45   60
1  54    70   26   90
2  78    89   45   24

In [9]:
df.shape

(3, 4)

In [10]:
df.size

12

In [11]:
df.ndim

2

# Adding Record(Row) to the data Frame

In [12]:
import pandas as pd

In [13]:
df2=pd.DataFrame([[10,12,45,60]],columns=["CD","DBMS","DSS","CAO"])

In [21]:
df3 = pd.concat([df, df2], ignore_index=True)

In [22]:
df3

   CD  DBMS  DSS  CAO
0  10    12   45   60
1  54    70   26   90
2  78    89   45   24
3  10    12   45   60

In [26]:
df3.shape

(4, 4)

In [27]:
df3.size

16

In [28]:
df3.ndim

2

# Adding Attribute(Columns) name DM

In [29]:
df3["DM"]=[12,15,90,85]

In [30]:
df3

   CD  DBMS  DSS  CAO  DM
0  10    12   45   60  12
1  54    70   26   90  15
2  78    89   45   24  90
3  10    12   45   60  85

# Deleting Record from df3 dataframe

In [33]:
df4=df3.drop(index=[1])

In [34]:
df4

   CD  DBMS  DSS  CAO  DM
0  10    12   45   60  12
2  78    89   45   24  90
3  10    12   45   60  85

# Deleting Attribute(Columns) from df3 dataframe

In [35]:
df5=df3.drop(columns=["DM"])

In [36]:
df5

   CD  DBMS  DSS  CAO
0  10    12   45   60
1  54    70   26   90
2  78    89   45   24
3  10    12   45   60

In [37]:
print("Mean of DSS:",df5["DSS"].mean())

Mean of DSS: 40.25

In [38]:
print("Median of DSS:",df5["DSS"].median())

Median of DSS: 45.0

In [39]:
print("Mode of DSS:",df5["DSS"].mode())

Mode of DSS: 0    45
Name: DSS, dtype: int64

# Conclusion :
               In this experiment, I have explored the basics of DataFrames by creating Series and DataFrames, adding records and attributes, and performing deletion operations. This helped in understanding the structure and dynamic manipulation capabilities of pandas DataFrames.